erp3l.Доработка/src/Documents/ллл_ЛогистическаяСделка/ллл_ЛогистическаяСделка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ллл_ЛогистическаяСделка</name>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставкиПредполагаемая</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодРС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ллл_СтатусыЛогистическихСделок</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРС</name>
    <comment>DT_NO реквизит из РС</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаказыПоставщикам</name>
    <attributes>
      <name>ЗаказПоставщику</name>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗаказа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриобретениеТоваровУслуг</name>
      <type>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПриобретения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредварительныйЗаказВендору</name>
      <type>
        <types>DocumentRef.ллл_ПредварительныйЗаказЗаводуИзготовителю</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПредварительногоЗаказа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erp3l.Доработка/src/Documents/ллл_ЛогистическаяСделка/ManagerModule.bsl
Процедура ЗаполнитьСтрокиПредварительногоЗаказаВендору(ПредварительныйЗаказВендору = Неопределено, НоваяСтрока) Экспорт
	
	Запрос = Новый Запрос;
	Заказы = Новый Массив;
	Заказы.Добавить(ПредварительныйЗаказВендору);
	Запрос.УстановитьПараметр("Заказы", Заказы);

	Запрос.Текст = "ВЫБРАТЬ
					|	ПЗВ.Ссылка КАК ПредварительныйЗаказВендору,
					|	ПЗВ.СуммаДокумента КАК СуммаПредварительногоЗаказа,
					|	З.Ссылка КАК ЗаказПоставщику,
					|	З.СуммаДокумента КАК СуммаЗаказа,
					|	П.Ссылка КАК ПриобретениеТоваровУслуг,
					|	П.СуммаДокумента КАК СуммаПриобретения
					|ИЗ
					|	Документ.ллл_ПредварительныйЗаказЗаводуИзготовителю КАК ПЗВ
					|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК З
					|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК П
					|				ПО (П.ЗаказПоставщику = З.Ссылка
					|					И П.Ссылка.Проведен)		
					|			ПО (З.ДокументОснование = ПЗВ.Ссылка
					|					И З.Ссылка.Проведен)		
					|ГДЕ
					|	ПЗВ.Ссылка В (&Заказы)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры
